{
  "3": [
    "Who is the threat actor or the espionage group or the main adversary behind this?",
    "Who are the members of the threat actor group?",
    "Who are the known associates or collaborators of the threat actor?",
    "Who are the primary targets of the threat actor?",
    "Who are the victims affected by the threat actor's activities?",
    "What type of threat is being posed by the actor?",
    "What are the main objectives of the threat actor?",
    "What tactics, techniques, and procedures (TTPs) does the threat actor use?",
    "What tools or malware does the threat actor employ?",
    "What indicators of compromise (IOCs) are associated with the threat actor?",
    "When did the threat activity occur?",
    "When was the threat actor first identified?",
    "When were the previous attacks carried out by the threat actor?",
    "When did the threat actor last exhibit activity?",
    "Where have the threat actor's attacks been observed?",
    "Where are the primary targets located?",
    "How is the threat actor executing the attacks?",
    "How does the threat actor evade detection?",
    "How does the threat actor gain initial access?",
    "How does the threat actor maintain persistence?",
    "How does the threat actor move laterally within a network?",
    "How does the threat actor exfiltrate data?",
    "What industries are most affected by the threat actor?",
    "What tools or softwares are being used?",
    "Any Relevant Vulnerability id?"
  ],
  "2": [
    "Who is responsible for distributing the malware?",
    "Who are the primary victims of the malware attack?",
    "Who discovered the malware?",
    "Who is targeted by the malware?",
    "What type of malware is being used (e.g., ransomware, trojan, virus, worm)?",
    "What is the main functionality of the malware?",
    "What vulnerabilities does the malware exploit?",
    "What are the indicators of compromise (IOCs) for the malware?",
    "What systems or software are affected by the malware?",
    "What is the malware's infection vector?",
    "What tools or techniques are used to distribute the malware?",
    "What are the potential impacts of the malware?",
    "When was the malware first detected?",
    "When did the malware activity peak?",
    "When were the systems infected by the malware?",
    "When was the last known activity of the malware?",
    "Where is the malware believed to originate from?",
    "Where have the malware infections been observed?",
    "Where are the primary targets located?",
    "Where are the command and control (C2) servers for the malware hosted?",
    "Why is the malware being used (e.g., financial gain, espionage, disruption)?",
    "Why are specific targets being chosen by the malware?",
    "How does the malware spread?",
    "How does the malware execute on infected systems?",
    "How does the malware maintain persistence on infected systems?",
    "How does the malware communicate with its command and control servers?",
    "How does the malware exfiltrate data?",
    "How can the malware be detected?",
    "How can the malware be removed?",
    "What are the known variants of the malware?",
    "What is the financial impact of the malware on affected organizations?",
    "What countermeasures can be implemented to protect against the malware?",
    "What steps should be taken immediately after detecting the malware?",
    "What are the long-term strategies to mitigate the malware risk?",
    "What are the common signs of a malware infection?",
    "What are the best practices for preventing malware infections?",
    "What is the historical context of the malware (e.g., previous outbreaks)?",
    "What industries are most affected by the malware?"
  ]
}